In [2]:
# NoPaymentDue,Enlisted,Service,Disabled
# Unemployed, Enrolled,School, Region
import pandas as pd

In [3]:
# read all the required files

# read NoPaymentDue file for NoPaymentDue
import re

def read_prolog_file(filename):
    with open(filename, 'r') as f:
        content = f.readlines()
    return content

# read the file and extract the facts
content1 = read_prolog_file(filename='datasets\\no_payment_due.pl')

facts = []
for line in content1:
    match = re.match(r'no_payment_due\(student(\d+),(.+)\)\.', line.strip())
    if match:
        studentid, status = match.groups()
        facts.append([studentid, status])
        
df1 = pd.DataFrame(facts, columns=['StudentID', 'NoPaymentDue'])
display(df1.head(), df1.shape)

  StudentID NoPaymentDue
0      1000          pos
1       999          pos
2       998          pos
3       996          pos
4       994          pos

(1000, 2)

In [4]:
# count the unique values for each unique studentid and sort by NoPaymentDue
df1.groupby('StudentID').NoPaymentDue.count().sort_values(ascending=False)

StudentID
1      1
702    1
691    1
692    1
693    1
      ..
402    1
403    1
404    1
405    1
999    1
Name: NoPaymentDue, Length: 1000, dtype: int64

In [5]:
# Enlisted file for Enlisted and Service
content2 = read_prolog_file(filename='datasets\\enlist.pl')

facts = []
for line in content2:
    match = re.match(r'enlist\(student(\d+),(.+)\)\.', line.strip())
    if match:
        studentid, service = match.groups()
        facts.append([studentid, service])

df2 = pd.DataFrame(facts, columns=['StudentID', 'Service'])
display(df2.head(), df2.shape)

  StudentID          Service
0        40  fire_department
1        51  fire_department
2       109  fire_department
3       139  fire_department
4       148  fire_department

(306, 2)

In [6]:
# count the unique values for each unique studentid and sort by Service
df2.groupby('StudentID').Service.count().sort_values(ascending=False)

StudentID
562    2
160    2
51     2
168    2
634    2
      ..
415    1
420    1
423    1
424    1
999    1
Name: Service, Length: 283, dtype: int64

In [7]:
# read Disabled file for Disabled
content3 = read_prolog_file(filename='datasets\\disabled.pl')

facts = []
for line in content3:
    match = re.match(r'disabled\(student(\d+)\)\.', line.strip())
    if match:
        studentid = match.groups()
        facts.append([studentid[0], 'Disabled'])

df3 = pd.DataFrame(facts, columns=['StudentID', 'Disabled'])
display(df3.head(), df3.shape)

  StudentID  Disabled
0       992  Disabled
1       976  Disabled
2       963  Disabled
3       918  Disabled
4       913  Disabled

(95, 2)

In [8]:
# count the unique values for each unique studentid and sort by Disabled
df3.groupby('StudentID').Disabled.count().sort_values(ascending=False)

StudentID
114    1
634    1
698    1
680    1
68     1
      ..
351    1
349    1
336    1
316    1
992    1
Name: Disabled, Length: 95, dtype: int64

In [9]:
# read Unemployed file for Unemployed
content4 = read_prolog_file(filename='datasets\\unemployed.pl')

facts = []
for line in content4:
    match = re.match(r'unemployed\(student(\d+)\)\.', line.strip())
    if match:
        studentid = match.groups()
        facts.append([studentid[0], 'Unemployed'])

df4 = pd.DataFrame(facts, columns=['StudentID', 'Unemployed'])
display(df4.head(), df4.shape)

  StudentID  Unemployed
0      1000  Unemployed
1       996  Unemployed
2       993  Unemployed
3       948  Unemployed
4       946  Unemployed

(98, 2)

In [10]:
# count the unique values for each unique studentid and sort by Unemployed
df4.groupby('StudentID').Unemployed.count().sort_values(ascending=False)

StudentID
1000    1
705     1
690     1
69      1
688     1
       ..
368     1
352     1
351     1
349     1
996     1
Name: Unemployed, Length: 98, dtype: int64

In [11]:
# read Enrolled file for Enrolled and School
content5 = read_prolog_file(filename = 'datasets\\enrolled.pl')

facts = []
for line in content5:
    match = re.match(r'enrolled\(student(\d+),(.+),(.+)\)\.', line.strip())
    if match:
        studentid, school, units = match.groups()
        facts.append([studentid, school, units])

df5 = pd.DataFrame(facts, columns=['StudentID', 'School', 'Units'])
display(df5.head(), df5.shape)

  StudentID School Units
0        10    ucb     2
1        18   ucsd     4
2        20   ucsd     3
3        35   ucsd     4
4        44   ucsd     1

(1194, 3)

In [12]:
# count the unique values for each unique studentid and sort by School
df5.groupby('StudentID').School.count().sort_values(ascending=False)

StudentID
726    2
678    2
250    2
722    2
253    2
      ..
436    1
437    1
438    1
439    1
999    1
Name: School, Length: 960, dtype: int64

In [13]:
# count the unique values for each unique studentid and sort by Units
df5.groupby('StudentID').Units.count().sort_values(ascending=False)

StudentID
726    2
678    2
250    2
722    2
253    2
      ..
436    1
437    1
438    1
439    1
999    1
Name: Units, Length: 960, dtype: int64

In [14]:
# read Region file for Region
# from Region,Martial Status.xlsx, with column names: StudentId, Country, Region, Marital_Status
df6 = pd.read_excel('datasets\Region, Marital Status.xlsx')
df6.columns = ['StudentID', 'Country', 'Region', 'Marital_Status']
df6_filtered = df6.loc[:,['StudentID', 'Region']]
display(df6_filtered.head(), df6_filtered.shape)

   StudentID  Region
0          1       2
1          2       5
2          3       2
3          4       1
4          5       3

(1000, 2)

In [15]:
# count the unique values for each unique studentid and sort by Region
df6_filtered.groupby('StudentID').Region.count().sort_values(ascending=False)

StudentID
1       1
672     1
659     1
660     1
661     1
       ..
339     1
340     1
341     1
342     1
1000    1
Name: Region, Length: 1000, dtype: int64

# Merging

In [16]:
# create a df with columns: StudentID, NoPaymentDue, Enlisted 
# Service, Disabled, Unemployed, Enrolled, School, Region
df = df1.copy()

# add Enlisted and Service columns to df by using df2
# Enlisted: 1 if the corresponding StudentId in df2 is in df1; 0 otherwise
# Service: the corresponding Service in df2 if the corresponding StudentId in df2 is in df1; NaN otherwise
df = df.merge(df2, how='left', on='StudentID')
df['Enlisted'] = df['Service'].apply(lambda x: 1 if pd.notnull(x) else 0)
df['Service'] = df['Service'].fillna('NaN')
display(df.head(), df.shape)

  StudentID NoPaymentDue          Service  Enlisted
0      1000          pos        air_force         1
1       999          pos  fire_department         1
2       998          pos              NaN         0
3       996          pos             navy         1
4       994          pos              NaN         0

(1023, 4)

In [17]:
# add Disabled column to df by using df3
# Disabled: 1 if the corresponding StudentId in df3 is in df1; 0 otherwise
df = df.merge(df3, how='left', on='StudentID')
df['Disabled'] = df['Disabled'].apply(lambda x: 1 if pd.notnull(x) else 0)
display(df.head(), df.shape)

  StudentID NoPaymentDue          Service  Enlisted  Disabled
0      1000          pos        air_force         1         0
1       999          pos  fire_department         1         0
2       998          pos              NaN         0         0
3       996          pos             navy         1         0
4       994          pos              NaN         0         0

(1023, 5)

In [18]:
# add Unemployed column to df by using df4
# Unemployed: 1 if the corresponding StudentId in df4 is in df1; 0 otherwise
df = df.merge(df4, how='left', on='StudentID')
df['Unemployed'] = df['Unemployed'].apply(lambda x: 1 if pd.notnull(x) else 0)
display(df.head(), df.shape)

  StudentID NoPaymentDue          Service  Enlisted  Disabled  Unemployed
0      1000          pos        air_force         1         0           1
1       999          pos  fire_department         1         0           0
2       998          pos              NaN         0         0           0
3       996          pos             navy         1         0           1
4       994          pos              NaN         0         0           0

(1023, 6)

In [19]:
# add Enrolled, School, Units columns to df by using df5
# Enrolled: 1 if the corresponding StudentId in df5 is in df1; 0 otherwise
# School: the corresponding School in df5 if the corresponding StudentId in df5 is in df1; NaN otherwise
# Units: the corresponding Units in df5 if the corresponding StudentId in df5 is in df1; NaN otherwise
df = df.merge(df5, how='left', on='StudentID')
df['Enrolled'] = df['School'].apply(lambda x: 1 if pd.notnull(x) else 0)
df['School'] = df['School'].fillna('NaN')
df['Units'] = df['Units'].fillna('NaN')
display(df.head(), df.shape)

,StudentID,NoPaymentDue,Service,Enlisted,Disabled,Unemployed,School,Units,Enrolled
0,1000,pos,air_force,1,0,1,ucsd,5,1
1,1000,pos,air_force,1,0,1,occ,9,1
2,999,pos,fire_department,1,0,0,smc,4,1
3,998,pos,NaN,0,0,0,ucb,1,1
4,998,pos,NaN,0,0,0,smc,1,1

(1260, 9)

In [20]:
# add Region column to df by using df6_filtered
# Region: the corresponding Region in df6_filtered if the corresponding StudentId in df6_filtered is in df1; NaN otherwise
# conver studentid to number in df
df['StudentID'] = df['StudentID'].apply(lambda x: int(x))
df = df.merge(df6_filtered, how='left', on='StudentID')
df['Region'] = df['Region'].fillna('NaN')
display(df.head(), df.shape)

,StudentID,NoPaymentDue,Service,Enlisted,Disabled,Unemployed,School,Units,Enrolled,Region
0,1000,pos,air_force,1,0,1,ucsd,5,1,1
1,1000,pos,air_force,1,0,1,occ,9,1,1
2,999,pos,fire_department,1,0,0,smc,4,1,2
3,998,pos,NaN,0,0,0,ucb,1,1,5
4,998,pos,NaN,0,0,0,smc,1,1,5

(1260, 10)

# issues

In [21]:
# issues: there are duplicate rows in df2 and df5
# check duplicate rows in df2, and sort by StudentID
df2[df2.duplicated(subset='StudentID', keep=False)].sort_values(by='StudentID')

    StudentID          Service
3         139  fire_department
273       139  fire_department
268       160  fire_department
52        160  fire_department
53        161  fire_department
267       161   foreign_legion
6         168  fire_department
265       168        air_force
9         224  fire_department
252       224      peace_corps
10        233  fire_department
251       233             navy
14        280  fire_department
244       280        air_force
17        304  fire_department
233       304             army
230       313        air_force
18        313  fire_department
21        340  fire_department
223       340             army
22        349  fire_department
221       349             navy
200       458      peace_corps
27        458  fire_department
1          51  fire_department
296        51          marines
295        53   foreign_legion
51         53  fire_department
188       539             army
30        539  fire_department
181       562          marines
32        562  fire_department
180       568             army
33        568  fire_department
163       634             army
36        634  fire_department
141       714             army
41        714  fire_department
112       839   foreign_legion
72        839  fire_department
109       854  fire_department
46        854  fire_department
105       876   foreign_legion
74        876  fire_department
49        985  fire_department
83        985             navy

In [22]:
# count the number of duplicate rows in df2
df2[df2.duplicated(subset='StudentID', keep=False)].shape

(46, 2)

In [23]:
# check duplicate rows in df5, and sort by StudentID
df5[df5.duplicated(subset='StudentID', keep=False)].sort_values(by='StudentID')

     StudentID School Units
0           10    ucb     2
1185        10    smc     1
255       1000    occ     9
253       1000   ucsd     5
1097       101   ucla     7
...        ...    ...   ...
262        992    smc    11
254        995   ucsd     3
260        995    uci     9
257        998    smc     1
252        998    ucb     1

[468 rows x 3 columns]

In [24]:
# check duplicate rows on studentid and school in df5, and sort by StudentID
df5[df5.duplicated(subset=['StudentID', 'School'], keep=False)].sort_values(by='StudentID')

Empty DataFrame
Columns: [StudentID, School, Units]
Index: []

In [25]:
# count the number of duplicate rows in df5
df5[df5.duplicated(subset='StudentID', keep=False)].shape

(468, 3)

In [26]:
# check the studentid=10 in df
df[df['StudentID']==10]

,StudentID,NoPaymentDue,Service,Enlisted,Disabled,Unemployed,School,Units,Enrolled,Region
1256,10,neg,NaN,0,0,0,ucb,2,1,4
1257,10,neg,NaN,0,0,0,smc,1,1,4

In [27]:
df_school_dup = df5[df5.duplicated(subset='StudentID', keep=False)].sort_values(by='StudentID')
# get a list of unique studentid in df_school_dup
studentid_dup_list = df_school_dup['StudentID'].unique()
studentid_dup_list

array(['10', '1000', '101', '104', '107', '109', '111', '120', '122',
       '130', '131', '142', '147', '150', '154', '161', '162', '169',
       '17', '179', '18', '186', '189', '193', '20', '21', '213', '214',
       '218', '221', '225', '227', '232', '233', '240', '241', '242',
       '245', '250', '253', '255', '263', '267', '268', '271', '275',
       '279', '28', '289', '290', '298', '299', '301', '308', '309', '31',
       '314', '316', '32', '339', '343', '348', '35', '350', '359', '363',
       '367', '369', '370', '374', '379', '382', '385', '391', '396',
       '399', '403', '41', '411', '413', '415', '421', '43', '44', '440',
       '441', '450', '457', '463', '47', '470', '472', '481', '486',
       '487', '497', '498', '500', '501', '502', '505', '513', '514',
       '518', '52', '523', '525', '528', '530', '532', '533', '535',
       '538', '551', '552', '555', '564', '571', '574', '576', '578',
       '583', '584', '59', '590', '595', '598', '6', '60', '602', '604',
       '605', '606', '609', '612', '615', '619', '62', '623', '624',
       '629', '64', '650', '658', '670', '675', '678', '68', '680', '682',
       '69', '690', '698', '702', '710', '722', '723', '726', '735',
       '737', '738', '740', '744', '75', '753', '769', '773', '777',
       '778', '78', '785', '787', '791', '792', '796', '798', '8', '810',
       '812', '816', '822', '825', '829', '832', '835', '836', '838',
       '840', '842', '844', '845', '850', '851', '858', '860', '863',
       '864', '87', '871', '876', '879', '888', '890', '895', '90', '900',
       '91', '919', '923', '924', '925', '927', '931', '936', '938',
       '942', '946', '948', '95', '953', '954', '959', '960', '961',
       '969', '975', '978', '982', '983', '984', '991', '992', '995',
       '998'], dtype=object)

In [28]:
df_dup_service = df2[df2.duplicated(subset='StudentID', keep=False)].sort_values(by='StudentID')
# get a list of unique studentid in df_dup_service
studentid_dup_service_list = df_dup_service['StudentID'].unique()
studentid_dup_service_list

array(['139', '160', '161', '168', '224', '233', '280', '304', '313',
       '340', '349', '458', '51', '53', '539', '562', '568', '634', '714',
       '839', '854', '876', '985'], dtype=object)

In [29]:
# check if there is any studentid in studentid_dup_list that is in studentid_dup_service_list
for studentid in studentid_dup_list:
    if studentid in studentid_dup_service_list:
        print(studentid)

161
233
876

In [31]:
# get the row that studentid=161 in df2
df2[df2['StudentID']=='161']

    StudentID          Service
53        161  fire_department
267       161   foreign_legion

In [32]:
# get the row that studentid=161 in df5
df5[df5['StudentID']=='161']

     StudentID School Units
13         161   ucsd     1
1045       161    smc     2

In [33]:
# get the row that studentid=233 in df2
df2[df2['StudentID']=='233']

    StudentID          Service
10        233  fire_department
251       233             navy

In [34]:
# get the row that studentid=233 in df5
df5[df5['StudentID']=='233']

    StudentID School Units
128       233   ucsd     2
978       233    uci     8

In [35]:
# get the row that studentid=876 in df2
df2[df2['StudentID']=='876']

    StudentID          Service
74        876  fire_department
105       876   foreign_legion

In [36]:
# get the row that studentid=876 in df5
df5[df5['StudentID']=='876']

    StudentID School Units
71        876   ucsd     2
369       876    uci     4